cuu/YAHAL/src/MCU/rp2040/startup_rp2040.cpp
#include "system_rp2040.h"

#include "RP2040.h"
using namespace _PPB_;

#ifdef __cplusplus
extern "C" {
#endif

// Macro Definitions
#define WEAK_FUNC(FUN) \
void FUN(void) __attribute__ ((weak));
#define WEAK_INT_FUNC(FUN) \
int FUN() __attribute__ ((weak));
#define WEAK_ALIAS_FUNC(FUN, FUN_ALIAS) \
void FUN(void) __attribute__ ((weak, alias(#FUN_ALIAS)));
#define WEAK_ALIAS_INT_FUNC(FUN, FUN_ALIAS) \
int FUN() __attribute__ ((weak, alias(#FUN_ALIAS)));

// External variables and functions
extern void     __cmsis_start(void);
extern uint32_t __StackTop;

typedef void (*pFunc)(void);

// Forward declaration of the implemented handlers.
[[noreturn]] WEAK_FUNC(Default_Handler)
WEAK_FUNC(Reset_Handler)
WEAK_INT_FUNC(return_0)

// Cortex-M0+ Processor Exceptions
WEAK_ALIAS_FUNC(NMI_Handler,           Default_Handler)
WEAK_ALIAS_FUNC(HardFault_Handler,     Default_Handler)
WEAK_ALIAS_FUNC(SVC_Handler,           Default_Handler)
WEAK_ALIAS_FUNC(PendSV_Handler,        Default_Handler)
WEAK_ALIAS_FUNC(SysTick_Handler,       Default_Handler)

// Device specific interrupt handler
WEAK_ALIAS_FUNC(TIMER_IRQ_0_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(TIMER_IRQ_1_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(TIMER_IRQ_2_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(TIMER_IRQ_3_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(PWM_IRQ_WRAP_Handler,  Default_Handler)
WEAK_ALIAS_FUNC(USBCTRL_IRQ_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(XIP_IRQ_Handler,       Default_Handler)
WEAK_ALIAS_FUNC(PIO0_IRQ_0_Handler,    Default_Handler)
WEAK_ALIAS_FUNC(PIO0_IRQ_1_Handler,    Default_Handler)
WEAK_ALIAS_FUNC(PIO1_IRQ_0_Handler,    Default_Handler)
WEAK_ALIAS_FUNC(PIO1_IRQ_1_Handler,    Default_Handler)
WEAK_ALIAS_FUNC(DMA_IRQ_0_Handler,     Default_Handler)
WEAK_ALIAS_FUNC(DMA_IRQ_1_Handler,     Default_Handler)
WEAK_ALIAS_FUNC(IO_IRQ_BANK0_Handler,  Default_Handler)
WEAK_ALIAS_FUNC(IO_IRQ_QSPI_Handler,   Default_Handler)
WEAK_ALIAS_FUNC(SIO_IRQ_PROC0_Handler, Default_Handler)
WEAK_ALIAS_FUNC(SIO_IRQ_PROC1_Handler, Default_Handler)
WEAK_ALIAS_FUNC(CLOCKS_IRQ_Handler,    Default_Handler)
WEAK_ALIAS_FUNC(SPI0_IRQ_Handler,      Default_Handler)
WEAK_ALIAS_FUNC(SPI1_IRQ_Handler,      Default_Handler)
WEAK_ALIAS_FUNC(UART0_IRQ_Handler,     Default_Handler)
WEAK_ALIAS_FUNC(UART1_IRQ_Handler,     Default_Handler)
WEAK_ALIAS_FUNC(ADC_IRQ_FIFO_Handler,  Default_Handler)
WEAK_ALIAS_FUNC(I2C0_IRQ_Handler,      Default_Handler)
WEAK_ALIAS_FUNC(I2C1_IRQ_Handler,      Default_Handler)
WEAK_ALIAS_FUNC(RTC_IRQ_Handler,       Default_Handler)

// The interrupt vector table.
void (* const isr_vector[])(void) __attribute__((section(".isr_vector"), used)) = {
    (pFunc) &__StackTop,            // The initial stack pointer

    Reset_Handler,                  // -15 The reset handler
    NMI_Handler,                    // -14 The NMI handler
    HardFault_Handler,              // -13 The hard fault handler
    0,                              // -12 Reserved
    0,                              // -11 Reserved
    0,                              // -10 Reserved
    0,                              //  -9 Reserved
    0,                              //  -8 Reserved
    0,                              //  -7 Reserved
    0,                              //  -6 Reserved
    SVC_Handler,                    //  -5 SVCall handler
    0,                              //  -4 Reserved
    0,                              //  -3 Reserved
    PendSV_Handler,                 //  -2 The PendSV handler
    SysTick_Handler,                //  -1 The SysTick handler

    TIMER_IRQ_0_Handler,            //   0 TIMER_IRQ_0
    TIMER_IRQ_1_Handler,            //   1 TIMER_IRQ_1
    TIMER_IRQ_2_Handler,            //   2 TIMER_IRQ_2
    TIMER_IRQ_3_Handler,            //   3 TIMER_IRQ_3
    PWM_IRQ_WRAP_Handler,           //   4 PWM_IRQ_WRAP
    USBCTRL_IRQ_Handler,            //   5 USBCTRL_IRQ
    XIP_IRQ_Handler,                //   6 XIP_IRQ
    PIO0_IRQ_0_Handler,             //   7 PIO0_IRQ_0
    PIO0_IRQ_1_Handler,             //   8 PIO0_IRQ_1
    PIO1_IRQ_0_Handler,             //   9 PIO1_IRQ_0
    PIO1_IRQ_1_Handler,             //  10 PIO1_IRQ_1
    DMA_IRQ_0_Handler,              //  11 DMA_IRQ_0
    DMA_IRQ_1_Handler,              //  12 DMA_IRQ_1
    IO_IRQ_BANK0_Handler,           //  13 IO_IRQ_BANK0
    IO_IRQ_QSPI_Handler,            //  14 IO_IRQ_QSPI
    SIO_IRQ_PROC0_Handler,          //  15 SIO_IRQ_PROC0
    SIO_IRQ_PROC1_Handler,          //  16 SIO_IRQ_PROC1
    CLOCKS_IRQ_Handler,             //  17 CLOCKS_IRQ
    SPI0_IRQ_Handler,               //  18 SPI0_IRQ
    SPI1_IRQ_Handler,               //  19 SPI1_IRQ
    UART0_IRQ_Handler,              //  20 UART0_IRQ
    UART1_IRQ_Handler,              //  21 UART1_IRQ
    ADC_IRQ_FIFO_Handler,           //  22 ADC_IRQ_FIFO
    I2C0_IRQ_Handler,               //  23 I2C0_IRQ
    I2C1_IRQ_Handler,               //  24 I2C1_IRQ
    RTC_IRQ_Handler                 //  25 RTC_IRQ
};

// The ELF entry point. This code first checks if the CPU
// is running a flash image or a ram image (flash is located
// at 0x10xxxxxx, ram is located at 0x20xxxxxx).
// flash image: Use the ISR vector table of the bootrom
//              at address 0x0. Jump to the reset handler
//              and let the bootrom initialize the XIP and
//              find (and run) a flash image.
// ram image:   After downloading a UF2 ram image, the bootrom
//              will jump to 0x20000001. So the _elf_entry_point
//              is located at 0x20000000, and will use the
//              ISR vector table of the ram image, located at
//              __vector_start__.
void _elf_entry_point() __attribute__((section(".reset"), naked, used));
void _elf_entry_point() {
    asm volatile(
    "       .syntax unified             @ \n"
    "       movs    r0, #0              @ R0 is pointer to the isr vector.\n"
    "                                   @ Default is bootrom at 0x0.      \n"
    "       mov     r3, pc              @ Get the most significant byte   \n"
    "       lsrs    r3, r3, 24          @ of the PC.                      \n"
    "       cmp     r3, #0x01           @ Are we running a FLASH image?   \n"
    "       beq     _do_reset           @ If yes, branch to reset routine \n"
    "       ldr     r0, =__vector_start__ @ Load vector table start       \n"
    "_do_reset:                         @                                 \n"
    "       ldr     r1, =0xe000ed08     @ Load VTOR register address ...  \n"
    "       str     r0, [r1]            @ ... and store value             \n"
    "       ldmia   r0!, {r1, r2}       @ R1=initial SP, R2=reset handler \n"
    "       msr     msp, r1             @ set the master stack pointer... \n"
    "       bx      r2                  @ ...and jump to reset handler.   \n");
}

// The reset irq handler
void Reset_Handler(void) {
    // Initialize the hardware
    SystemInit();
    // Let CMSIS code do the initialization of the C++ runtime and jump to main.
    __cmsis_start();
}

// This is the code that gets called when the processor receives an unexpected
// interrupt. This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
[[noreturn]] void Default_Handler(void) {
    // Enter an infinite loop.
    while (true) { }
}

// Dummy Posix File IO functions to suppress linker warnings
WEAK_ALIAS_INT_FUNC( _read,   return_0 );
WEAK_ALIAS_INT_FUNC( _write,  return_0 );
WEAK_ALIAS_INT_FUNC( _open,   return_0 );
WEAK_ALIAS_INT_FUNC( _close,  return_0 );
WEAK_ALIAS_INT_FUNC( _link,   return_0 );
WEAK_ALIAS_INT_FUNC( _unlink, return_0 );
WEAK_ALIAS_INT_FUNC( _stat,   return_0 );
WEAK_ALIAS_INT_FUNC( _fstat,  return_0 );
WEAK_ALIAS_INT_FUNC( _lseek,  return_0 );
WEAK_ALIAS_INT_FUNC( _isatty, return_0 );
WEAK_ALIAS_INT_FUNC( _kill,   return_0 );
WEAK_ALIAS_INT_FUNC( _getpid, return_0 );

int return_0() {
    return 0;
}

#ifdef __cplusplus
}
#endif
